In [2]:
import pandas as pd
from sktime.datasets import load_tsf_to_dataframe

In [14]:
df, metadata = load_tsf_to_dataframe('../../raw_data/saugeenday_dataset.tsf')
df.head()

                        series_value
series_name timestamp
T1          1915-01-01          11.5
            1915-01-02          10.8
            1915-01-03          13.7
            1915-01-04          13.7
            1915-01-05          14.4

In [15]:
df = df.reset_index()
df = df[['timestamp', 'series_value']].rename(columns={'timestamp': 'ts'})
df['ts'] = pd.to_datetime(df['ts'])
df = df.sort_values('ts')

In [16]:
df

              ts  series_value
0     1915-01-01          11.5
1     1915-01-02          10.8
2     1915-01-03          13.7
3     1915-01-04          13.7
4     1915-01-05          14.4
...          ...           ...
23736 1979-12-27         121.0
23737 1979-12-28          79.9
23738 1979-12-29          59.5
23739 1979-12-30          49.3
23740 1979-12-31          44.0

[23741 rows x 2 columns]

In [18]:
missing_values = df.isnull().sum()
time_deltas = df['ts'].diff()
most_common_freq = time_deltas.mode()[0]
duplicate_timestamps = df['ts'].duplicated().sum()
irregular_intervals = df[time_deltas != most_common_freq]

# Print summary of issues
print("Missing values per column:\n", missing_values)
print("Most common frequency between timestamps:", most_common_freq)
print("Number of duplicate timestamps:", duplicate_timestamps)
print("Number of irregular intervals:", irregular_intervals.shape[0])

Missing values per column:
 ts              0
series_value    0
dtype: int64
Most common frequency between timestamps: 1 days 00:00:00
Number of duplicate timestamps: 0
Number of irregular intervals: 1

In [19]:
df.to_csv('../../transformed_data/cleaned_saugeenday.csv', index=False)